src/InformationRegisters/РегиональныеРуководителиФСВТС/РегиональныеРуководителиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегиональныеРуководителиФСВТС</name>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РегиональныеРуководителиФСВТС/ManagerModule.bsl
///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьРуководителя(Заказчик) Экспорт
	Результат 		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	РегиональныеРуководителиФСВТС.Руководитель КАК Руководитель
	             	  |ИЗ
	             	  |	РегистрСведений.РегиональныеРуководителиФСВТС КАК РегиональныеРуководителиФСВТС
	             	  |ГДЕ
	             	  |	РегиональныеРуководителиФСВТС.Заказчик = &Заказчик";
	Запрос.УстановитьПараметр("Заказчик", Заказчик);
	Выборка 		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат 	= Выборка.Руководитель;
	КонецЕсли; // Если Выборка.Следующий() Тогда
	
	Возврат Результат;
КонецФункции // ПолучитьРуководителя
